xively/xively-client-c/examples/cc3200/xively_firmware_updates/main.c
/* Copyright (c) 2003-2016, LogMeIn, Inc. All rights reserved.
 *
 * This is part of the Xively C Client library,
 * it is licensed under the BSD 3-Clause license.
 */

//*****************************************************************************
//
// Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/
//
//
//  Redistribution and use in source and binary forms, with or without
//  modification, are permitted provided that the following conditions
//  are met:
//
//    Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

// Simplelink includes
#include "simplelink.h"

// Driverlib includes
#include "hw_gpio.h"
#include "hw_ints.h"
#include "hw_memmap.h"
#include "hw_types.h"
#include "interrupt.h"
#include "pin.h"
#include "prcm.h"
#include "rom.h"
#include "rom_map.h"
#include "utils.h"
#include "gpio.h"

// Simpelink EXT lib includes
#include "flc.h"

// Common interface includes
#include "button_if.h"
#include "common.h"
#include "gpio_if.h"
#include "i2c_if.h"
#include "pinmux.h"
#include "tmp006drv.h"

// required by sprintf
#include <stdio.h>

#ifndef NOTERM
#include "uart_if.h"
#endif

#define XIVELY_DEMO_PRINT( ... )                                                         \
    UART_PRINT( __VA_ARGS__ );                                                           \
    printf( __VA_ARGS__ );

#define APPLICATION_NAME "XIVELY_CC3200_FIRMWARE_UPDATE_APP"
#define APPLICATION_VERSION "0.0.1"
#define SUCCESS 0

// Values for below macros shall be modified per the access-point's (AP) properties.
// SimpleLink device will connect to following AP when the application is executed.
#define ENT_NAME "Amped_AP"
#define PASSWORD "wireless"

// Values for below macros will be used for connecting the device to Xively's
// MQTT broker
#define XIVELY_DEVICE_ID "a9dd3d46-b040-4899-9e40-7a9b407aa330"
#define XIVELY_DEVICE_SECRET "ToeM7ibJ5pSPy4Lr+7Cn/O7Y+EysnmiFmsGl47G+clI="
#define XIVELY_ACCOUNT_ID "223151b6-7476-4832-b189-e52def8c6a7e"

// Application specific status/error codes
typedef enum {
    // Choosing -0x7D0 to avoid overlap w/ host-driver's error codes
    LAN_CONNECTION_FAILED      = -0x7D0,
    DEVICE_NOT_IN_STATION_MODE = LAN_CONNECTION_FAILED - 1,
    STATUS_CODE_MAX            = -0xBB8
} e_AppStatusCodes;

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************
volatile unsigned long g_ulStatus = 0;              // SimpleLink Status
unsigned long g_ulGatewayIP       = 0;              // Network Gateway IP address
unsigned char g_ucConnectionSSID[SSID_LEN_MAX + 1]; // Connection SSID
unsigned char g_ucConnectionBSSID[BSSID_LEN_MAX];   // Connection BSSID

#if defined( ccs )
extern void ( *const g_pfnVectors[] )( void );
#endif
#if defined( ewarm )
extern uVectorEntry __vector_table;
#endif
//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************

//****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//****************************************************************************
long MainLogic();
static void BoardInit( void );
static void InitializeAppVariables();
void ConnectToXively();
void WaitForWlanEvent();

/******************************************************************************/
/* BEGINNING OF XIVELY CODE */
/******************************************************************************/

/* Includes used by the code below. */
#include <time.h>
#include <xi_bsp_rng.h>
#include <xi_bsp_time.h>
#include <xively.h>

/* xively SFT client includes */
#include <xi_sft.h>

/******************************************************************************/
/* BEGINNING OF XIVELY CODE GLOBAL SECTION */
/******************************************************************************/

/* Names of the MQTT topics used by this application */
const char* const gTemperatureTopicName =
    "xi/blue/v1/" XIVELY_ACCOUNT_ID "/d/" XIVELY_DEVICE_ID "/Temperature";
const char* const gBlinkTopicName =
    "xi/blue/v1/" XIVELY_ACCOUNT_ID "/d/" XIVELY_DEVICE_ID "/blink";
const char* const gButtonSW2TopicName =
    "xi/blue/v1/" XIVELY_ACCOUNT_ID "/d/" XIVELY_DEVICE_ID "/Button SW2";
const char* const gButtonSW3TopicName =
    "xi/blue/v1/" XIVELY_ACCOUNT_ID "/d/" XIVELY_DEVICE_ID "/Button SW3";

/* Required by push button interrupt handlers - there is no space for user argument so we
 * can't pass the xively's context handler as a function argument. */
xi_context_handle_t gXivelyContextHandle = -1;

/* Used to store the temperature timed task handles. */
xi_timed_task_handle_t gTemperatureTaskHandle = -1;


/******************************************************************************/
/* END OF XIVELY CODE GLOBAL SECTION */
/******************************************************************************/

void send_fileinfo( const xi_context_handle_t context_handle,
                    const xi_timed_task_handle_t timed_task_handle,
                    void* user_data )
{
    XIVELY_DEMO_PRINT("send_fileinfo\n");
    xi_publish_file_info( context_handle );
}


/**
* @brief Event handler for SW2 button press/release interrupts.
 *
 * The pinValue will be 1 on a button press event, 0 on button up..
 */
void pushButtonInterruptHandlerSW2()
{
    int pinValue = GPIOPinRead( GPIOA2_BASE, GPIO_PIN_6 );

    if ( pinValue == 0 )
    {
        xi_publish( gXivelyContextHandle, gButtonSW2TopicName, "0",
                    XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    }
    else
    {
        if ( XI_INVALID_TIMED_TASK_HANDLE ==
                xi_schedule_timed_task( gXivelyContextHandle, send_fileinfo, 1, 0, NULL ) )
        {
            XIVELY_DEMO_PRINT( "send_file_info couldn't be registered\n" );
        }

        xi_publish( gXivelyContextHandle, gButtonSW2TopicName, "1",
                XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    }

    Button_IF_EnableInterrupt( SW2 );
}

/**
 * @brief Event handler for SW2 button press/release interrupts.
 *
 * The pinValue will be 1 on a button press event, 0 on button up.
 */
void pushButtonInterruptHandlerSW3()
{
    int pinValue = GPIOPinRead( GPIOA1_BASE, GPIO_PIN_5 );

    if ( pinValue == 0 )
    {
        xi_publish( gXivelyContextHandle, gButtonSW3TopicName, "0",
                    XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    }
    else
    {
        xi_publish( gXivelyContextHandle, gButtonSW3TopicName, "1",
                    XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    }

    Button_IF_EnableInterrupt( SW3 );
}

/**
 * @brief Function that handles messages sent to the device on the `blink` topic.
 *
 * @note For more details please refer to the xively.h - xi_subscribe function.
 *
 * @param in_context_handle - xively library context required for calling API functions
 * @param call_type - describes if the handler was called carrying the subscription
 * operation result or the incoming message
 * @oaram params - structure with data
 * @param state - state of the operation
 * @oaram user_data - optional data, in this case nothing.
 */
void on_blink_topic( xi_context_handle_t in_context_handle,
                     xi_sub_call_type_t call_type,
                     const xi_sub_call_params_t* const params,
                     xi_state_t state,
                     void* user_data )
{
    switch ( call_type )
    {
        case XI_SUB_CALL_SUBACK:
            if ( params->suback.suback_status == XI_MQTT_SUBACK_FAILED )
            {
                XIVELY_DEMO_PRINT( "topic:%s. Subscription failed.\n",
                                   params->suback.topic );
            }
            else
            {
                XIVELY_DEMO_PRINT( "topic:%s. Subscription granted %d.\n",
                                   params->suback.topic,
                                   ( int )params->suback.suback_status );
            }
            return;
        case XI_SUB_CALL_MESSAGE:
            if ( params->message.temporary_payload_data_length == 1 )
            {
                static int toggle_lights = 0;
                toggle_lights = (toggle_lights + 1) % 2;

                if( toggle_lights )
                {
                   GPIO_IF_LedOn( MCU_GREEN_LED_GPIO );
                   GPIO_IF_LedOn( MCU_ORANGE_LED_GPIO );
                }
                else
                {
                    GPIO_IF_LedOff( MCU_GREEN_LED_GPIO );
                    GPIO_IF_LedOff( MCU_ORANGE_LED_GPIO );
                }
            }
            else
            {
                XIVELY_DEMO_PRINT( "unexpected data length on topic %s \n",
                                   params->message.topic );
            }
            return;
        default:
            return;
    }
}


/**
 * @brief Recurring time task that temporarily activates the device's temperature sensor,
 * publishes the result on the temperature topic for the device, an then re-enables LED
 * control.
 *
 * @note for more details about user time tasks please refer to the xively.h -
 * xi_schedule_timed_task function.
 *
 * @param context_handle - xively library context required for calling API functions
 * @param timed_task_handle - handle to *this* timed task, can be used to re-schedule or
 * cancel the task
 * @param user_data - data assosicated with this timed task
 */
void send_temperature( const xi_context_handle_t context_handle,
                       const xi_timed_task_handle_t timed_task_handle,
                       void* user_data )
{
    XIVELY_DEMO_PRINT(".");
    if( 1 == 1 )
        return;

    /* Prepare configuration for temperature sensor for I2C bus */
    PinTypeI2C( PIN_01, PIN_MODE_1 );
    PinTypeI2C( PIN_02, PIN_MODE_1 );

    int lRetVal        = -1;
    float fCurrentTemp = .0f;
    char msg[16]       = {'\0'};

    /* I2C Init */
    lRetVal = I2C_IF_Open( I2C_MASTER_MODE_FST );
    if ( lRetVal < 0 )
    {
        ERR_PRINT( lRetVal );
        goto end;
    }

    /* Init Temperature Sensor */
    lRetVal = TMP006DrvOpen();
    if ( lRetVal < 0 )
    {
        ERR_PRINT( lRetVal );
        goto end;
    }

    TMP006DrvGetTemp( &fCurrentTemp );

