xively/xively-client-c/examples/cc3200/xively_firmware_updates/main.c
    sprintf( ( char* )&msg, "%5.02f", fCurrentTemp );
    xi_publish( context_handle, gTemperatureTopicName, msg, XI_MQTT_QOS_AT_MOST_ONCE,
                XI_MQTT_RETAIN_FALSE, NULL, NULL );

    do
    {
    } while ( I2C_IF_Close() != 0 );

end:
    /* Restore configuration for LED control */
    PinTypeGPIO( PIN_01, PIN_MODE_0, false );
    GPIODirModeSet( GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT );

    PinTypeGPIO( PIN_02, PIN_MODE_0, false );
    GPIODirModeSet( GPIOA1_BASE, 0x8, GPIO_DIR_MODE_OUT );
}

/**
 * @brief Handler function for eventa related to changes in connection state.
 *
 * @note for more details please refer to xively.h - xi_connect function.
 *
 * @param context_handle - xively library context required for calling API functions
 * @param data - points to the structure that holds detailed information about the
 * connection state and settings
 * @param state - additional internal state of the library helps to determine the reason
 * of connection failure or disconnection
 */
void on_connected( xi_context_handle_t in_context_handle, void* data, xi_state_t state )
{
    xi_connection_data_t* conn_data = ( xi_connection_data_t* )data;

    switch ( conn_data->connection_state )
    {
        case XI_CONNECTION_STATE_OPEN_FAILED:
            XIVELY_DEMO_PRINT( "connection to %s:%d has failed reason %d\n",
                               conn_data->host, conn_data->port, state );

            xi_connect( in_context_handle, conn_data->username, conn_data->password,
                        conn_data->connection_timeout, conn_data->keepalive_timeout,
                        conn_data->session_type, &on_connected );

            return;
        case XI_CONNECTION_STATE_OPENED:
            XIVELY_DEMO_PRINT( "connected to %s:%d\n", conn_data->host, conn_data->port );

            /* register a function to publish temperature data every 5 seconds */
#if 1
            gTemperatureTaskHandle =
                xi_schedule_timed_task( in_context_handle, send_temperature, 5, 1, NULL );

            if ( XI_INVALID_TIMED_TASK_HANDLE == gTemperatureTaskHandle )
            {
                XIVELY_DEMO_PRINT( "send_temperature_task couldn't be registered\n" );
            }
#endif

            xi_subscribe( in_context_handle, gBlinkTopicName,
                          XI_MQTT_QOS_AT_MOST_ONCE, on_blink_topic, NULL );

            xi_sft_init( in_context_handle, XIVELY_ACCOUNT_ID, XIVELY_DEVICE_ID );

            /* enable the button interrupts */
            Button_IF_EnableInterrupt( SW2 | SW3 );

            break;
        case XI_CONNECTION_STATE_CLOSED:
            XIVELY_DEMO_PRINT( "connection closed - reason %d!\n", state );

            /* cancel timed task - we don't want to send messages while the library not
             * connected */
            xi_cancel_timed_task( gTemperatureTaskHandle );
            gTemperatureTaskHandle = XI_INVALID_TIMED_TASK_HANDLE;

            /* disable button interrupts so the messages for button push/release events
             * won't be sent */
            Button_IF_DisableInterrupt( SW2 | SW3 );

            /* check if the close was due to the user's request */
            if ( XI_STATE_OK == state )
            {
                xi_events_stop();
            }
            else
            {
                WaitForWlanEvent();

                xi_connect( in_context_handle, conn_data->username, conn_data->password,
                            conn_data->connection_timeout, conn_data->keepalive_timeout,
                            conn_data->session_type, &on_connected );
            }
            return;
        default:
            XIVELY_DEMO_PRINT( "invalid parameter %d\n", conn_data->connection_state );
            return;
    }
}

/**
 * @brief Driver for the xively library logic
 *
 * This function initialises the library, creates a context and starts the internal event
 * dispatcher and event processing of xively library.
 *
 * This function is blocking for the sakness of this demo application however it is
 * possible to run xively's event processing with limit of iterations.
 */
void ConnectToXively()
{
    /* Register Push Button Handlers */
    Button_IF_Init( pushButtonInterruptHandlerSW2, pushButtonInterruptHandlerSW3 );

    /* Make the buttons to react on both press and release events */
    MAP_GPIOIntTypeSet( GPIOA1_BASE, GPIO_PIN_5, GPIO_BOTH_EDGES );
    MAP_GPIOIntTypeSet( GPIOA2_BASE, GPIO_PIN_6, GPIO_BOTH_EDGES );

    /* Disable the interrupt for now */
    Button_IF_DisableInterrupt( SW2 | SW3 );

    xi_state_t ret_state = xi_initialize( "account_id", "xi_username", 0 );

    if ( XI_STATE_OK != ret_state )
    {
        XIVELY_DEMO_PRINT( "xi failed to initialise\n" );
        return;
    }

    gXivelyContextHandle = xi_create_context();

    if ( XI_INVALID_CONTEXT_HANDLE == gXivelyContextHandle )
    {
        XIVELY_DEMO_PRINT( " xi failed to create context, error: %d\n",
                           -gXivelyContextHandle );
        return;
    }

    xi_state_t connect_result =
        xi_connect( gXivelyContextHandle, XIVELY_DEVICE_ID, XIVELY_DEVICE_SECRET, 10, 0,
                    XI_SESSION_CLEAN, &on_connected );

    /* start processing xively library events */
    xi_events_process_blocking();

    /* when the event dispatcher is stop destroy the context */
    xi_delete_context( gXivelyContextHandle );

    /* shutdown the xively library */
    xi_shutdown();
}

/**
 * @brief Function that is required by TLS library to track the current time.
 */
time_t XTIME( time_t* timer )
{
    return xi_bsp_time_getcurrenttime_seconds();
}

/**
 * @brief Function required by the TLS library.
 */
uint32_t xively_ssl_rand_generate()
{
    return xi_bsp_rng_get();
}

/******************************************************************************/
/* END OF XIVELY CODE */
/******************************************************************************/

//*****************************************************************************
// These functions are from the ent_wlan example of the CC3200 SDK. They exist in this
// project to facilitate state tracking of the WiFi connection for the device and are not
// Xively specific.
//
// If you would like more information and documentation on these functions, please see the
// source code in the directory example/ent_wlan of your CC3200 SDK installation.
//*****************************************************************************

