xively/xively-client-c/examples/cc3200/xively_firmware_updates/main.c
void SimpleLinkWlanEventHandler( SlWlanEvent_t* pWlanEvent )
{
    if ( !pWlanEvent )
    {
        return;
    }

    switch ( pWlanEvent->Event )
    {
        case SL_WLAN_CONNECT_EVENT:
        {
            SET_STATUS_BIT( g_ulStatus, STATUS_BIT_CONNECTION );

            // Copy new connection SSID and BSSID to global parameters
            memcpy( g_ucConnectionSSID,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_name,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_len );
            memcpy( g_ucConnectionBSSID,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.bssid,
                    SL_BSSID_LENGTH );

            XIVELY_DEMO_PRINT( "[WLAN EVENT] STA Connected to the AP: %s , "
                               "BSSID: %x:%x:%x:%x:%x:%x\n",
                               g_ucConnectionSSID, g_ucConnectionBSSID[0],
                               g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                               g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                               g_ucConnectionBSSID[5] );
        }
        break;

        case SL_WLAN_DISCONNECT_EVENT:
        {
            slWlanConnectAsyncResponse_t* pEventData = NULL;

            CLR_STATUS_BIT( g_ulStatus, STATUS_BIT_CONNECTION );
            CLR_STATUS_BIT( g_ulStatus, STATUS_BIT_IP_AQUIRED );

            pEventData = &pWlanEvent->EventData.STAandP2PModeDisconnected;

            // If the user has initiated 'Disconnect' request,
            //'reason_code' is SL_WLAN_DISCONNECT_USER_INITIATED_DISCONNECTION
            if ( SL_USER_INITIATED_DISCONNECTION == pEventData->reason_code )
            {
                XIVELY_DEMO_PRINT( "[WLAN EVENT]Device disconnected from the AP: %s, "
                                   "BSSID: %x:%x:%x:%x:%x:%x on application's request \n",
                                   g_ucConnectionSSID, g_ucConnectionBSSID[0],
                                   g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                                   g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                                   g_ucConnectionBSSID[5] );
            }
            else
            {
                XIVELY_DEMO_PRINT( "[WLAN ERROR]Device disconnected from the AP AP: %s,"
                                   "BSSID: %x:%x:%x:%x:%x:%x on an ERROR..!! \n",
                                   g_ucConnectionSSID, g_ucConnectionBSSID[0],
                                   g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                                   g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                                   g_ucConnectionBSSID[5] );
            }
            memset( g_ucConnectionSSID, 0, sizeof( g_ucConnectionSSID ) );
            memset( g_ucConnectionBSSID, 0, sizeof( g_ucConnectionBSSID ) );
        }
        break;

        default:
        {
            XIVELY_DEMO_PRINT( "[WLAN EVENT] Unexpected event [0x%x]\n",
                               pWlanEvent->Event );
        }
        break;
    }
}

void SimpleLinkNetAppEventHandler( SlNetAppEvent_t* pNetAppEvent )
{
    if ( !pNetAppEvent )
    {
        return;
    }

    switch ( pNetAppEvent->Event )
    {
        case SL_NETAPP_IPV4_IPACQUIRED_EVENT:
        {
            SlIpV4AcquiredAsync_t* pEventData = NULL;

            SET_STATUS_BIT( g_ulStatus, STATUS_BIT_IP_AQUIRED );

            // Ip Acquired Event Data
            pEventData = &pNetAppEvent->EventData.ipAcquiredV4;

            // Gateway IP address
            g_ulGatewayIP = pEventData->gateway;

            XIVELY_DEMO_PRINT(
                "[NETAPP EVENT] IP Acquired: IP=%d.%d.%d.%d ,"
                "Gateway=%d.%d.%d.%d\n",
                SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.ip, 3 ),
                SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.ip, 2 ),
                SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.ip, 1 ),
                SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.ip, 0 ),
                SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.gateway, 3 ),
                SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.gateway, 2 ),
                SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.gateway, 1 ),
                SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.gateway, 0 ) );
        }
        break;

        default:
        {
            XIVELY_DEMO_PRINT( "[NETAPP EVENT] Unexpected event [0x%x] \n",
                               pNetAppEvent->Event );
        }
        break;
    }
}

void SimpleLinkHttpServerCallback( SlHttpServerEvent_t* pHttpEvent,
                                   SlHttpServerResponse_t* pHttpResponse )
{
    // Unused in this application
}

void SimpleLinkGeneralEventHandler( SlDeviceEvent_t* pDevEvent )
{
    XIVELY_DEMO_PRINT( "[GENERAL EVENT] - ID=[%d] Sender=[%d]\n\n",
                       pDevEvent->EventData.deviceEvent.status,
                       pDevEvent->EventData.deviceEvent.sender );
}

void SimpleLinkSockEventHandler( SlSockEvent_t* pSock )
{
    if ( !pSock )
    {
        return;
    }

    //
    // This application doesn't work w/ socket - Events are not expected
    //
    switch ( pSock->Event )
    {
        case SL_SOCKET_TX_FAILED_EVENT:
            switch ( pSock->socketAsyncEvent.SockTxFailData.status )
            {
                case SL_ECLOSE:
                    XIVELY_DEMO_PRINT( "[SOCK ERROR] - close socket (%d) operation "
                                       "failed to transmit all queued packets\n\n",
                                       pSock->socketAsyncEvent.SockTxFailData.sd );
                    break;
                default:
                    XIVELY_DEMO_PRINT( "[SOCK ERROR] - TX FAILED  :  socket %d , reason "
                                       "(%d) \n\n",
                                       pSock->socketAsyncEvent.SockTxFailData.sd,
                                       pSock->socketAsyncEvent.SockTxFailData.status );
                    break;
            }
            break;

        default:
            XIVELY_DEMO_PRINT( "[SOCK EVENT] - Unexpected Event [%x0x]\n\n",
                               pSock->Event );
            break;
    }
}

_SlEventPropogationStatus_e
sl_Provisioning_HttpServerEventHdl( SlHttpServerEvent_t* apSlHttpServerEvent,
                                    SlHttpServerResponse_t* apSlHttpServerResponse )
{
    // Unused in this application
    return EVENT_PROPAGATION_CONTINUE;
}

_SlEventPropogationStatus_e
sl_Provisioning_NetAppEventHdl( SlNetAppEvent_t* apNetAppEvent )
{
    // Unused in this application
    return EVENT_PROPAGATION_CONTINUE;
}

_SlEventPropogationStatus_e sl_Provisioning_WlanEventHdl( SlWlanEvent_t* apEventInfo )
{
    // Unused in this application
    return EVENT_PROPAGATION_CONTINUE;
}

