xively/xively-client-c/examples/cc3200/xively_firmware_updates/main.c
    }
    //
    // Close boot info function
    //
    sl_FsClose(lFileHandle, 0, 0, 0);

    return 1;
}

long MainLogic()
{
    SlSecParams_t g_SecParams;
    long lRetVal          = -1;
    unsigned char pValues = 0;

    InitializeAppVariables();

    lRetVal = ConfigureSimpleLinkToDefaultState();
    if ( lRetVal < 0 )
    {
        if ( DEVICE_NOT_IN_STATION_MODE == lRetVal )
            XIVELY_DEMO_PRINT( "Failed to configure the device "
                               "in its default state \n" );

        return lRetVal;
    }

    CLR_STATUS_BIT_ALL( g_ulStatus );

    // Start simplelink
    lRetVal = sl_Start( 0, 0, 0 );
    if ( lRetVal < 0 || ROLE_STA != lRetVal )
    {
        XIVELY_DEMO_PRINT( "Failed to start the device \n" );
        return lRetVal;
    }

    XIVELY_DEMO_PRINT("\nIMAGE VERSION -- IN MEMORY!!! \n");

    // start ent wlan connection
    g_SecParams.Key    = PASSWORD;
    g_SecParams.KeyLen = strlen( ( const char* )g_SecParams.Key );
    g_SecParams.Type   = SL_SEC_TYPE_WPA_WPA2;

    // 0 - Disable the server authnetication | 1 - Enable (this is the deafult)
    pValues = 0;
    sl_WlanSet( SL_WLAN_CFG_GENERAL_PARAM_ID, 19, 1, &pValues );

    // add the wlan profile
    sl_WlanProfileAdd( ENT_NAME, strlen( ENT_NAME ), 0, &g_SecParams, 0, 1, 0 );

    // set the connection policy to auto
    pValues = 0;
    sl_WlanPolicySet( SL_POLICY_CONNECTION, SL_CONNECTION_POLICY( 1, 1, 0, 0, 0 ),
                      &pValues, 1 );

    // wait for the WiFi connection
    WaitForWlanEvent();

    // read image information
    readBootinfo();

    // this is where the connection to Xively Broker can be established
    ConnectToXively();

    // wait for few moments
    MAP_UtilsDelay( 80000000 );

    // Disconnect from network
    lRetVal = sl_WlanDisconnect();

    //
    // power off the network processor
    //
    lRetVal = sl_Stop( SL_STOP_TIMEOUT );

    return SUCCESS;
}

int main()
{
    long lRetVal = -1;

    //
    // Initialize Board configurations
    //
    BoardInit();

    PinMuxConfig();

    // configure RED and Green LED
    GPIO_IF_LedConfigure( LED1 | LED2 | LED3 );

#ifndef NOTERM
    InitTerm();
    ClearTerm();
#endif

    lRetVal = MainLogic();

    if ( lRetVal < 0 )
    {
        ERR_PRINT( lRetVal );
    }

    LOOP_FOREVER();
}
